![](logo.png)

# <font color='red'>Pandas Dataframes</font>

> ### Introduction to Pandas
> ### Pandas Series
> ### Pandas Dataframe Basics
> ### Pandas Dataframe Operations

In this section of the class, we will learn how to use pandas for data analysis. You can think of pandas as an extremely powerful version of Excel, with more features.

# <font color='red'>Introduction to Pandas</font>

Pandas is a data analysis and manipulation library that is built on top of NumPy. For this reason, not only does the Pandas library need to be imported, but so does Numpy in order to use all of the functionality.

In [146]:
import pandas as pd
import numpy as np

# <font color='red'>Pandas Series</font>

The first main data type we will learn about in the Pandas library is the series data type. A series is very similar to a NumPy array. What differentiates the NumPy array from a series, is that a series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python object

## Creating a Series

You can convert a list, NumPy array, or dictionary to a series

In [147]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [148]:
# Converting to a series
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [149]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [150]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [151]:
# Using NumPy Arrays
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [152]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [153]:
# From a dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

## Data in a Series

A Pandas Series can hold a variety of object types

In [154]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [155]:
# Functions can be put into a Pandas Series
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an Index

The key to using a Series is understanding indexing. Pandas makes use of these index names or numbers by allowing for fast look-ups for information.

In [156]:
# Create a new series
series1 = pd.Series([1,2,3,4], index=['USA','Germany','Russia','Japan'])

In [157]:
series1

USA        1
Germany    2
Russia     3
Japan      4
dtype: int64

In [158]:
series2 = pd.Series([1,2,3,4], index=['USA','Germany','Italy','Japan'])

In [159]:
series2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [160]:
series1['USA']

1

Operations can be performed on series or between two series

In [161]:
series1 + series2

Germany    4.0
Italy      NaN
Japan      8.0
Russia     NaN
USA        2.0
dtype: float64

# <font color='red'>Pandas Dataframe Basics</font>

Pandas Dataframes are the workhorse of Pandas and are directly inspired by the R programming language. We can think of a Dataframe as a bunch of Pandas Series objects put together that share an index

In [162]:
np.random.seed(101)

## Creating a Pandas Dataframe

Use the Pandas method **DataFrame()** to create a new Dataframe. Don't forget to reference the pandas library

In [163]:
df = pd.DataFrame({'A':[1,2,3],
                  'B':[4,5,6],
                  'C':[7,8,9]})
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [164]:
# Create a new Pandas Dataframe 
df = pd.DataFrame(np.random.randn(5,4), index = ['A','B','C','D','E'], columns = ['W','X','Y','Z'])

In [165]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

Use the bracket notation from NumPy arrays/matrices to index a Pandas Dataframe. Similar to R, columns and rows can be indexed using the name of the column or row.

In [166]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [167]:
# Pass a list of column names to reference multiple columns
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

Similar to the R '$' notation, a decimal can be used to select a column 
<br>**Not Recommended**

In [168]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [169]:
# Dataframe columns are just Series
type(df['W'])

pandas.core.series.Series

In [170]:
# Creating a new column
df['new'] = df['W'] + df['Y']

In [171]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

To remove a column, use the Pandas method **drop()**

In [172]:
# Drop 'new' and use the axis arguemnt to select the column
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

NOTE: Pandas uses axis arguements to determine a row (axis=0) or column (axis=1) index

In [173]:
# Permanently delete the column 

# Reassign df
#df = df.drop('new', axis=1)

# Use the inplace=True arguement
df.drop('new', axis=1, inplace=True)

In [174]:
# Drop rows using axis=0
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

## Using loc and iloc to select rows and columns

loc uses names to select indexed rows or columns, iloc uses the position to select indexed rows or columns

In [175]:
# Selecting Rows using loc
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [176]:
# Selecting Rows using iloc
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [177]:
# Selecting a subset of rows and columns
df.loc['B','Y']

-0.8480769834036315

In [178]:
# Use bracket notation [Rows][Columnns] to multi-index
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

## Conditional Selection

An important feature of Pandas is conditional selection using braket notation, very similar to NumPy

In [179]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [180]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [181]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [182]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [183]:
df[df['W'] > 0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [184]:
df[df['W'] > 0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

Similar to R, mulitple conditions can be subset from a Pandas Dataframe using the & (and) and | (or) operators

In [185]:
df[(df['W'] > 0) & (df['Y'] > 0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

## More Index Details

There are quite a few features of indexing, including resetting the index or setting it to something else. This would be considered index heirarchy

In [186]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [187]:
# Reset to default 0, 1,...n index
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [188]:
new_index = 'CA NY WY OR CO'.split()

In [189]:
df['States'] = new_index

In [190]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [191]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [192]:
df.set_index('States',inplace=True)

In [193]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multi-Index and Index Hierarchy

In [194]:
# Create a multi-indexed Dataframe

# Index Levels
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [195]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [196]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

When the Pandas method **groupby()** is discussed, the results of a multi-level groupby analysis will result in a multi-indexed Dataframe. Let's see how you would index this hierarchy.

In [197]:
# Call first level
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [198]:
# Call first and second level
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [199]:
# Get a list of index names
df.index.names

FrozenList([None, None])

NOTE: These indexed columns don't have any names associated to them. Assign names setting names to df.index.names

In [200]:
df.index.names = ['Group','Num']

In [201]:
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

Another Pandas method for referencing multi-index Dataframs is **xs()**. This allows you to index without having to type so many loc or iloc indexed levels

In [202]:
# Call first level
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [203]:
# Call first and second levels
df.xs(['G1',1])

A    0.302665
B    1.693723
Name: (G1, 1), dtype: float64

In [204]:
# Call just the second level
df.xs(1, level='Num')

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

NOTE: Since this is in a hierarchy, the 'Num' level needs to be specifically called

## Missing Data

There are a couple of methods for handling missing data in Pandas Dataframes

In [205]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [206]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [207]:
# Drop all missing values - axis=0 is default
df.dropna()

     A    B  C
0  1.0  5.0  1

In [208]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [209]:
# Threshold of 2 missing values per row
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [210]:
# Change NA values to something eles
df.fillna(value='Missing')

         A        B  C
0        1        5  1
1        2  Missing  2
2  Missing  Missing  3

In [211]:
# Fill missing values in column A with the mean of column A
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Groupby

The groupby method allows you to group rows of data together (hierarchy) and call aggregate functions

In [212]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [213]:
df = pd.DataFrame(data)

In [214]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

Use the Pandas method **groupby()** to group rows together based off of a column name. For instance, companies within the dataframe can be grouped together. This will create a DataFrameGroupBy object

In [215]:
df.groupby('Company')

This can be assigned to a data object as a new variable

In [216]:
by_comp = df.groupby('Company')

Now that the groupby has been stored, a number of groupby methods can be used to analyze the groupby data

In [217]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

This can be strung together to show the same data aggregate

In [218]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More aggregate methods...

In [219]:
# Standard Deviation
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [220]:
# Minimum Values
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [221]:
# Maximum Values
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [222]:
# Counts
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [223]:
# Summary statistics
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [224]:
# Transpose the summary statistics
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [225]:
# Index from the transposed summary statistics
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

## Mergin, Joining and Concatenating

There are three main ways of combining DataFrames together: Merging, Joining and Concatenating. Let's look at examples of each.

In [226]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [227]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [228]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [229]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [230]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [231]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concatenation

Similar to rbind and cbind, the Pandas method **concat()** basically glues Dataframes together. Keep in mind that dimensions should match along the axis you are concatenating.

In [232]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [233]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging 

The Pandas method **merge()** allows you to merge Dataframes together using similar logic as merging SQL Tables

In [234]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [235]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [236]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [237]:
# Merge Left and Right on the Key and only keep the rows where key values match
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Add a little more complexity into the merge...

In [238]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [239]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [240]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [241]:
# Using two keys
pd.merge(left, right, on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [242]:
# Use an outer merge
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [243]:
# Merge on right Dataframe only
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [244]:
# Merge on left Dataframe only
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

### Joining

Joining is a convenient method for combining the columns of two potentially, differently-indexed Dataframes into a single resulting Dataframe

In [245]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [246]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [247]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [248]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [249]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# <font color='red'>Pandas Dataframe Operations</font>

There are tons of operations with the Pandas library that will be really helpful in working with Dataframes.

In [250]:
# Create a new dataframe
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [251]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [252]:
# Head and Tail Method
df.head(3)
df.tail(2)

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

### Unique Values

In [253]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [254]:
df['col2'].nunique()

3

In [255]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Other Pandas Methods

In [256]:
# Permanently Drop Columns
del df['col1']

In [257]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [258]:
# Get column and index names
df.columns

Index(['col2', 'col3'], dtype='object')

In [259]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [260]:
# Sorting and Ordering a Dataframe
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [261]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [262]:
# Find Null Values
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [263]:
# Drop rows with NaN values
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [264]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [265]:
# Fill in missing values
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [266]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [267]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

### Create a multi-index table

Use the Pandas method **pivot_table()** to group df into a hierarchical order

In [268]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

For a reference on using Pandas, use the following cheat sheet to strengthen your understanding on data manipulation and additional methods for aggrgating and analyzing Pandas Dataframes - [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)

## Built-in Dataframes - Seaborn

Use the Seaborn library to access built-in Dataframes to practice with Pandas Dataframe manipulation and analysis. We will be using the Seaborn library later on for data visualization. 

If Seaborn is not installed, use the Anaconda Prompt
    conda install seaborn

In [269]:
# Import Seaborn
import seaborn as sns

In [270]:
# Check Dataframe names - Ignore the warning
sns.get_dataset_names()

C:\Users\jcdunne\AppData\Local\Continuum\anaconda3\lib\site-packages\seaborn\utils.py:376: UserWarning: No parser was explicitly specified, so I'm using the best available HTML parser for this system ("lxml"). This usually isn't a problem, but if you run this code on another system, or in a different virtual environment, it may use a different parser and behave differently.

The code that caused this warning is on line 376 of the file C:\Users\jcdunne\AppData\Local\Continuum\anaconda3\lib\site-packages\seaborn\utils.py. To get rid of this warning, pass the additional argument 'features="lxml"' to the BeautifulSoup constructor.

  gh_list = BeautifulSoup(http)

['anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'iris',
 'mpg',
 'planets',
 'tips',
 'titanic']

In [271]:
# Load a Dataframe for practice
df = sns.load_dataset('iris')
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

# End Pandas DataFrames